HOMEWORK 1주차

In [ ]:

import numpy as np
rng=np.random.RandomState(100)
score=rng.randint(0, 101,(50,5))
score

가장 마지막 학생의 영어 점수가 9점이 아니라 90점이라고 한다. 이렇게 수정하기 위한 코드를 작성하시오.

In [ ]:
score[49][1]=90
print(score[len(score)-1])

모든 학생들의 수학점수가 1점을 줄여야 한다고 한다. 이렇게 수정하기 위한 코드를 작성하시오.

In [ ]:
score[:,2] = score[:,2] - 1
score[0], score[49]

50명의 추가 학생들의 점수가 다음 score_add 변수에 주어진다. 이를 score 변수 데이터 끝에 덧붙여 100명의 데이터를 저장하고자 한다. 이를 위한 코드를 작성하시오

In [ ]:
score_add=rng.randint(0, 101,(50,5))
score_add

In [ ]:
score=np.concatenate([score, score_add], axis=0)
score[0], score[49], score[50], score[99]

과목별 평균점수를 뜻하는 avg_subject array(1차원)를 구하는 코드를 작성하시오.

In [ ]:
avg_subject=np.mean(score, axis=0)
avg_subject

학생별 평균점수를 뜻하는 avg_student array(1차원)를 구하는 코드를 작성하시오.

In [ ]:
avg_student=np.mean(score, axis=1)
avg_student

각 점수가 해당과목의 평균으로부터 얼마나 차이가 나는지(이를 편차라고 한다.)를 나타내는 score_dev array(2차원)를 생성하시오.

score_dev의 shape는 score의 shape와 동일하다. 즉 (100, 5)
만약 어떤 학생의 국어 점수가 30점이고 국어 평균이 45점이면 그 차이는  30−45=−15  점이다.

In [ ]:
score_dev=score-avg_subject
score_dev[0], score_dev[99]

전체과목 평균점수를 기준으로 1등을 한 학생과 꼴등을 한 학생의 5개 과목 점수 array를 각각 student_best, _student_worst_에 각각 저장하시오.

In [ ]:
student_best = score[ np.argmax(avg_student) ]
student_worst = score[ np.argmin(avg_student) ]
student_best, student_worst

전체 학생의 평균점수를 구하여 avg_total 변수에 저장하시오.

In [ ]:
avg_total = np.average(score)
avg_total

과학점수가 사회점수보다 더 높은 학생 수를 구하여 no_student_sci 변수에 저장하시오.

In [ ]:
no_student_sci = np.sum(score[:,3] > score[:,4])
no_student_sci

******
********HOMEWORK 2주차

In [16]:
import numpy as np
import pandas as pd
np.random.seed(0)

sname=['s'+format(i, '03d') for i in range(100)]
noclass=np.random.randint(1, 6, 100)
gender=['female']*50 + ['male']*50
height=np.random.randint(160, 190, 100)
weight=np.random.randint(50, 80, 100)

문제1
sname, noclass, gender, height, weight를 column으로 사용하는 DataFrame 변수 student를 생성하시오. (index는 자동으로 생성되는 정수)

In [18]:
student=pd.DataFrame({'sname':sname, 'noclass':noclass, 'gender':gender, 'height':height, 'weight':weight})
student

   sname  noclass  gender  height  weight
0   s000        5  female     186      59
1   s001        1  female     183      68
2   s002        4  female     187      58
3   s003        4  female     162      72
4   s004        4  female     185      65
..   ...      ...     ...     ...     ...
95  s095        2    male     173      77
96  s096        1    male     167      58
97  s097        3    male     184      70
98  s098        3    male     184      54
99  s099        4    male     175      66

[100 rows x 5 columns]

문제2
1반부터 5반까지 담임교사의 성이 각각 Kim, Lee, Park, Choi, Yun이라고 할 때 반번호(1반~5반)와 담임교사의 이름(tname)을 column으로 가지는 DataFrame 변수 teacher를 생성하시오. (index는 자동으로 생성되는 정수값이다)

In [19]:
teacher=pd.DataFrame({'noclass':[1,2,3,4,5],'tname':['Kim','Lee','Park','Choi','Yun']})
teacher

   noclass tname
0        1   Kim
1        2   Lee
2        3  Park
3        4  Choi
4        5   Yun

문제3
두 DataFrame 변수 student와 teacher를 합쳐서 info 라는 이름의 DataFrame변수를 생성하시오.

noclass column이 key값이 된다.

In [21]:
info=student.merge(teacher)
info.head()

  sname  noclass  gender  height  weight tname
0  s000        5  female     186      59   Yun
1  s008        5  female     163      79   Yun
2  s011        5  female     163      72   Yun
3  s019        5  female     161      53   Yun
4  s037        5  female     184      79   Yun

문제4
ratio=height−weight  일 때 새로운 column인 ratio를 info 에 추가하시오.

In [23]:
info['ratio']=info['height']-info['weight']
info.head()

  sname  noclass  gender  height  weight tname  ration  ratio
0  s000        5  female     186      59   Yun     127    127
1  s008        5  female     163      79   Yun      84     84
2  s011        5  female     163      72   Yun      91     91
3  s019        5  female     161      53   Yun     108    108
4  s037        5  female     184      79   Yun     105    105

문제5
info에서 sname변수가 index로 되도록 변경한 info_sname 변수를 생성하시오.

In [24]:
info_sname=info.set_index('sname')
info_sname.head()

       noclass  gender  height  weight tname  ration  ratio
sname
s000         5  female     186      59   Yun     127    127
s008         5  female     163      79   Yun      84     84
s011         5  female     163      72   Yun      91     91
s019         5  female     161      53   Yun     108    108
s037         5  female     184      79   Yun     105    105

문제6
반별로 height, weight, ratio의 평균값을 구하여 아래 결과와 같이 dataframe 변수 info_avg에 저장하시오.

info와 info_sname 중 어떤 변수를 사용하여도 좋다.

In [25]:
info_avg=info.groupby('noclass').mean()
info_avg

             height     weight      ration       ratio
noclass
1        174.227273  62.090909  112.136364  112.136364
2        174.450000  64.100000  110.350000  110.350000
3        177.176471  64.000000  113.176471  113.176471
4        175.318182  63.818182  111.500000  111.500000
5        174.263158  64.526316  109.736842  109.736842

문제7
pivot_table을 사용하여 반별, 성별 weight 평균값을 구한 결과를 info_pivot 변수에 저장하시오.

In [26]:
info_pivot=info.pivot_table('weight',index='noclass',columns='gender')
info_pivot

gender      female       male
noclass
1        65.000000  57.888889
2        66.600000  61.600000
3        64.833333  63.545455
4        63.416667  64.300000
5        67.333333  62.000000

문제8
각 반에서 남학생과 여학생 수를 가리키는 DataFrame 변수 ct를 생성하시오.

(단, 이 때 noclass와 gender 순서로 multi-index하며 column이름은 count로 한다)

In [30]:
x=info.groupby(['noclass','gender'])['height'].count()
ct=pd.DataFrame({'count':x})
ct

                count
noclass gender
1       female     13
        male        9
2       female     10
        male       10
3       female      6
        male       11
4       female     12
        male       10
5       female      9
        male       10

문제9
각 학생의 키에서 남학생 혹은 여학생 전체 평균키를 뺀 값을 height_dev 제목의 column으로 info 변수에 추가하시오.

In [31]:
def compute_dev(x):
  x['height_dev']=x['height']-x['height'].mean()
  return x
info = info.groupby('gender').apply(compute_dev)

In [38]:
info

   sname  noclass  gender  height  weight tname  ration  ratio  height_dev
0   s000        5  female     186      59   Yun     127    127       12.42
1   s008        5  female     163      79   Yun      84     84      -10.58
2   s011        5  female     163      72   Yun      91     91      -10.58
3   s019        5  female     161      53   Yun     108    108      -12.58
4   s037        5  female     184      79   Yun     105    105       10.42
..   ...      ...     ...     ...     ...   ...     ...    ...         ...
95  s089        3    male     164      79  Park      85     85      -12.46
96  s092        3    male     185      66  Park     119    119        8.54
97  s093        3    male     166      53  Park     113    113      -10.46
98  s097        3    male     184      70  Park     114    114        7.54
99  s098        3    male     184      54  Park     130    130        7.54

[100 rows x 9 columns]

문제10
height_dev 가 0보다 큰 여학생 수 및 남학생 수를 각각 ct_tall_female 및 ct_tall_male 변수에 저장하시오.

In [40]:
ct_tall_female=np.sum((info['gender']=='female')&(info['height_dev']>0))
ct_tall_male=np.sum((info['gender']=='male')&(info['height_dev']>0))
ct_tall_female,ct_tall_male

(25, 25)